fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудник</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЦветовоеОформлениеНаСервере() ;
ВКМ_ОтпускаСотрудниковПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ВКМ_ОтпускаСотрудниковПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_ОтпускаСотрудников
&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВКМ_Сотрудник) И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВКМ_ДатаНачала)
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВКМ_ДатаОкончания) Тогда
		ВКМ_ОтпускаСотрудниковПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
&НаКлиенте
Процедура ВКМ_АнализГрафика(Команда)

    Парам = Новый Структура;
    Парам.Вставить("Ключ", Объект.Ссылка);
  	ДанныеГрафика = ВКМ_АнализГрафикаНаСервере();
    Парам.Вставить("ДанныеГрафика", ДанныеГрафика);

   ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ВКМ_АнализГрафика", Парам,
   				ЭтотОбъект, УникальныйИдентификатор,,,,
  				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);


КонецПроцедуры

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ОтпускаСотрудниковПриИзмененииНаСервере()
	Отб = Новый Структура;
	Отб.Вставить("ВКМ_Сотрудник", Справочники.ВКМ_Сотрудник.ПустаяСсылка());

	Для Каждого Стр Из Объект.ВКМ_ОтпускаСотрудников Цикл
		Отб.ВКМ_Сотрудник = Стр.ВКМ_Сотрудник;
		МДатОтп = Объект.ВКМ_ОтпускаСотрудников.НайтиСтроки(Отб);
		СумДОтп = 0;
		Для Каждого Эл Из МДатОтп Цикл
			РазницаВДнях = (НачалоДня(Эл.ВКМ_ДатаОкончания) - НачалоДня(Эл.ВКМ_ДатаНачала)) / (60 * 60 * 24);
			СумДОтп = СумДОтп + РазницаВДнях;
		КонецЦикла;

		Для Каждого Эл Из МДатОтп Цикл
			Эл.ВКМ_КоличествоДнейОтпуска = СумДОтп;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере  
Процедура ЦветовоеОформлениеНаСервере()  
// Цвет раскраски строк  
ЦветОформление = УсловноеОформление.Элементы.Добавить();  
ЦветОформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);  
// Условия раскраски  
ЭлементОформления = ЦветОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));  
ЭлементОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВКМ_ОтпускаСотрудников.ВКМ_КоличествоДнейОтпуска");  
ЭлементОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;  
ЭлементОформления.ПравоеЗначение = 28;  
// Определение табличной части для раскраски  
ЦветПоле = ЦветОформление.Поля.Элементы.Добавить();  
ЦветПоле.Поле = Новый ПолеКомпоновкиДанных("ВКМ_ОтпускаСотрудников");  
КонецПроцедуры  
//``` [3](https://koder.by/raskraska_tablichnoj_chasti_dokumenta.php)  
//Процедура ТаблицаПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)  
//ОформлениеСтроки.ЦветФона = WebЦвета.Зелёный  
//КонецПроцедуры  
//``` [1](https://forum.infostart.ru/forum9/topic218592/)[9](https://helpf.pro/faq/view/786.html)  


&НаСервере
Функция  ВКМ_АнализГрафикаНаСервере()
	ТЗ = Объект.ВКМ_ОтпускаСотрудников.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТЗ, ЭтаФорма.УникальныйИдентификатор);
КонецФункции
#КонецОбласти
